# Pandas

![title](images/pandasLogo.png)

### Pandas — програмна бібліотека, написана для мови програмування Python для маніпулювання даними та їхнього аналізу. 
Основними компонентами Pandas є **Series** і **DataFrame**.

Серія це певний набір елементів , можна трактувати як звичайний масив
* Індекс Значення
* 0--------1
* 1--------234
* 2--------34

In [1]:
# підключаємо бібліотеки
import pandas as pd

apples = pd.Series([3, 2, 0, 1])
oranges = pd.Series([0, 3, 7, 2])
print("apples")
print(apples)
print("oranges")
print(oranges)

apples
0    3
1    2
2    0
3    1
dtype: int64
oranges
0    0
1    3
2    7
3    2
dtype: int64

![title](images/series.png)

#### Dataframe - набір масивів

In [2]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}
fruits = pd.DataFrame(data)

fruits

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [3]:
fruits = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
fruits

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

## Спробуємо створити csv документ

![title](images/screen1.png)

Записуємо дані через кому , вверху назви колонок внизу значення

![title](images/screen2.png)

Перейменовуємо наш файл

![title](images/screen3.png)

## Зчитаємо готовий датасет (датасет - набір даних)

In [26]:
fruits_data = pd.read_csv("fruits_without_markets.csv")

Виведемо наш датасет

In [27]:
fruits_data

   apples  oranges  banana
0       5       34      12
1      12       34      42
2      13       53      23
3       2        4       2
4       5        3       2
5       8       23       2

Додамо індекси іменами магазинів ?

Зробимо зміни в нашому файлі просто додавши нові рядки 
![title](images/screen4.png)

In [28]:
fruits_data = pd.read_csv("fruits.csv")

In [29]:
fruits_data

               apples  oranges  banana
АТБ                 5       34      12
Арсен              12       34      42
Сільпо             13       53      23
Шувар               2        4       2
Народний            5        3       2
Близенько           8       23       2

 2 спосіб 
* fruits_data = pd.DataFrame(data, index=['АТБ', 'Арсен', 'Сільпо', 'Шувар' , 'Народний', 'Близенько'])

Команда loc (locate) оприділяє значення рядка по індексу

In [30]:
fruits_data.loc["АТБ"]

    apples     5
oranges       34
banana        12
Name: АТБ, dtype: int64

#### Вивести 5 перших елементів

In [31]:
fruits_data.head()

              apples  oranges  banana
АТБ                5       34      12
Арсен             12       34      42
Сільпо            13       53      23
Шувар              2        4       2
Народний           5        3       2

#### Вивести 5 останніх елементів

In [32]:
fruits_data.tail()

               apples  oranges  banana
Арсен              12       34      42
Сільпо             13       53      23
Шувар               2        4       2
Народний            5        3       2
Близенько           8       23       2

#### Вивести випадкових 2 рядків

In [33]:
fruits_data.sample(2)

           apples  oranges  banana
Шувар           2        4       2
Арсен          12       34      42

#### Вивести колонки

In [34]:
fruits_data.columns

Index(['    apples', 'oranges', 'banana'], dtype='object')

#### Вивести індекси

In [36]:
fruits_data.index

Index(['АТБ', 'Арсен', 'Сільпо', 'Шувар', 'Народний', 'Близенько'], dtype='object')

## Опис нашого датасету

In [37]:
fruits_data.describe()

           apples    oranges     banana
count     6.00000   6.000000   6.000000
mean      7.50000  25.166667  13.833333
std       4.32435  19.364056  16.129683
min       2.00000   3.000000   2.000000
25%       5.00000   8.750000   2.000000
50%       6.50000  28.500000   7.000000
75%      11.00000  34.000000  20.250000
max      13.00000  53.000000  42.000000